Repository: Ahmad-Jaber1/SurveyConfiguratorTask
Catalog: Localization/Errors.*.resx
Languages: ar

# COLUMN_ORDER
source: Order
ar: الترتيب

# COLUMN_QUESTION_TYPE
source: Question Type
ar: نوع السؤال

# COLUMN_TEXT
source: Text
ar: نص السؤال

# CONFIRM_DELETE_MESSAGE
source: Are you sure you want to delete the selected question?
ar: هل أنت متأكد من رغبتك في حذف السؤال المحدد؟

# CONFIRM_DELETE_TITLE
source: Confirm Delete
ar: تأكيد الحذف

# ConnectionStringInvalid
source: Cannot connect to the database. Please check your server name, database name, username, and password.
ar: لا يمكن الاتصال بقاعدة البيانات. يرجى التحقق من اسم الخادم واسم قاعدة البيانات واسم المستخدم وكلمة المرور.

# ConnectionStringNotSet
source: Database connection string is not set or invalid. Go to Settings → Database Connection to set it up.
ar: سلسلة الاتصال بقاعدة البيانات غير مضبوطة أو غير صالحة. انتقل إلى الإعدادات ← اتصال قاعدة البيانات لإعدادها.

# DatabaseConnectionFailed
source: Failed to connect to the database. Contact the administrator to resolve the issue.
ar: فشل الاتصال بقاعدة البيانات. يرجى التواصل مع المسؤول لحل المشكلة.

# ERROR_CAPTION_TEXT_EMPTY
source: Please enter a valid caption. The caption text cannot be empty or longer than 30 characters .
ar: يرجى إدخال نص بداية أو نهاية صحيح. لا يمكن أن يكون نص البداية أو النهاية فارغاً او يزيد طوله عن 30 حرفا .

# ERROR_END_VALUE_OUT_OF_RANGE
source: Please enter a valid end value. It must be between {0} and {1}
ar: الرجاء إدخال قيمة نهائية صحيحة. يجب أن تكون القيمة بين {0} و {1}

# ERROR_ORDER_VALUE_OUT_OF_RANGE
source: Please enter a valid order value. The value must be between 1 and {0}.
ar: يرجى إدخال قيمة طلب صحيحة. يجب أن تكون القيمة بين 1 و {0}.

# ERROR_QUESTION_TEXT_EMPTY
source: Please enter a valid question. The question text cannot be empty or longer than 60 characters.
ar: يرجى إدخال سؤال صحيح. لا يمكن أن يكون نص السؤال فارغاً أو يزيد طوله عن 60 حرفاً.

# ERROR_SMILEY_COUNT_INVALID
source: Please enter a valid smiley count. The value must be between 2 and 5.
ar: الرجاء إدخال عدد صحيح من الرموز التعبيرية. يجب أن تكون القيمة بين 2 و 5.

# ERROR_STARS_COUNT_INVALID
source: Please enter a valid stars count. The value must be between 1 and 10.
ar: يرجى إدخال عدد صحيح من النجوم. يجب أن تكون القيمة بين 1 و 10.

# ERROR_START_VALUE_OUT_OF_RANGE
source: Please enter a valid start value. It must be between 0 and {0}
ar: الرجاء إدخال قيمة بداية صحيحة. يجب أن تكون القيمة بين 0 و {0}

# NotFound_DeleteQuestion
source: Question not found.
ar: لم يتم العثور على السؤال.

# NotFound_EditQuestion
source: The specified question was not found. Please check your selection.
ar: لم يتم العثور على السؤال المحدد. يرجى مراجعة اختيارك.

# NotFound_GetQuestion
source: The specified question was not found. Please check your selection.
ar: لم يتم العثور على السؤال المحدد. يرجى مراجعة اختيارك.

# QUESTION_TYPE_SLIDER
source: Slider Question
ar: سؤال شريط التمرير

# QUESTION_TYPE_SMILEY
source: Smiley Question
ar: سؤال الوجوه المبتسمة

# QUESTION_TYPE_STARS
source: Stars Question
ar: سؤال النجوم

# SqlErrorAddQuestion
source: We couldn't save your question at the moment. Please try again later.
ar: لم نتمكن من حفظ سؤالك في الوقت الحالي. يرجى المحاولة مرة أخرى لاحقاً.

# SqlErrorDeleteQuestion
source: We couldn't delete your question at the moment. Please try again later.
ar: لم نتمكن من حذف سؤالك في الوقت الحالي. يرجى المحاولة مرة أخرى لاحقاً.

# SqlErrorEditOrder
source: We couldn't update order at the moment. Please try again later.
ar: لم نتمكن من تحديث الترتيب في الوقت الحالي. يرجى المحاولة مرة أخرى لاحقاً.

# SqlErrorEditQuestion
source: We couldn't update your question at the moment. Please try again later.
ar: لم نتمكن من تحديث سؤالك في الوقت الحالي. يرجى المحاولة مرة أخرى لاحقاً.

# SqlErrorGetCount
source: We couldn't retrieve the question count at the moment. Please try again later.
ar: لم نتمكن من استرجاع عدد الأسئلة في الوقت الحالي. يرجى المحاولة مرة أخرى لاحقاً.

# SqlErrorGetLastModified
source: We couldn't retrieve Last Modified. Please try again later.
ar: لم نتمكن من استرجاع تاريخ آخر تعديل. يرجى المحاولة مرة أخرى لاحقاً.

# SqlErrorGetQuestion
source: We couldn't retrieve the question. Please try again later.
ar: لم نتمكن من استرجاع السؤال. يرجى المحاولة مرة أخرى لاحقاً.

# SqlErrorSliderLoad
source: SQL error occurred while loading slider questions. Please contact support.
ar: حدث خطأ في SQL أثناء تحميل أسئلة شريط التمرير. يرجى التواصل مع الدعم الفني.

# SqlErrorSmileyLoad
source: SQL error occurred while loading smiley questions. Please contact support.
ar: حدث خطأ في SQL أثناء تحميل أسئلة الوجوه التعبيرية. يرجى التواصل مع الدعم الفني.

# SqlErrorStarsLoad
source: SQL error occurred while loading star questions. Please contact support.
ar: حدث خطأ في SQL أثناء تحميل أسئلة النجوم. يرجى التواصل مع الدعم الفني.

# SqlErrorUpdateLastModified
source: We couldn't update Last Modified. Please try again later.
ar: لم نتمكن من تحديث تاريخ آخر تعديل. يرجى المحاولة مرة أخرى لاحقاً.

# UI_ERROR_MESSAGE
source: An unexpected error occurred. Please contact support or the system administrator.
ar: حدث خطأ غير متوقع. يرجى الاتصال بالدعم الفني أو مسؤول النظام.

# UnknownErrorAddQuestion
source: Unexpected error occurred while adding question.
ar: حدث خطأ غير متوقع أثناء إضافة السؤال.

# UnknownErrorChangeConnectionString
source: We couldn't change connection string due to an unexpected error. Please try again or contact support..
ar: لم نتمكن من تغيير سلسلة الاتصال بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم الفني.

# UnknownErrorConnectionTest
source: We couldn't test connection due to an unexpected error. Please try again or contact support.
ar: لم نتمكن من اختبار الاتصال بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم الفني.

# UnknownErrorDeleteQuestion
source: We couldn't delete your question due to an unexpected error. Please try again or contact support.
ar: لم نتمكن من حذف سؤالك بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم.

# UnknownErrorEditOrder
source: We couldn't edit order due to an unexpected error.Please try again or contact support.
ar: لم نتمكن من تعديل الترتيب بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم.

# UnknownErrorEditQuestion
source: We couldn't edit question due to an unexpected error. Please try again or contact support.
ar: لم نتمكن من تعديل السؤال بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم.

# UnknownErrorGetConnectionString
source: We couldn't retrieve the connection string due to an unexpected error. Please try again or contact support.
ar: لم نتمكن من استرداد سلسلة الاتصال بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم الفني.

# UnknownErrorGetCount
source: We couldn't retrieve the question count due to an unexpected error. Please try again or contact support.
ar: لم نتمكن من استرجاع عدد الأسئلة بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم.

# UnknownErrorGetLastModified
source: We couldn't retrieve Last Modified due to an unexpected error. Please try again or contact support.
ar: لم نتمكن من استرجاع تاريخ آخر تعديل بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم الفني.

# UnknownErrorGetQuestion
source: We couldn't retrieve the question count due to an unexpected error. Please try again or contact support.
ar: لم نتمكن من استرجاع عدد الأسئلة بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم.

# UnknownErrorQuestionsLoad
source: Unexpected error occurred while loading questions.
ar: حدث خطأ غير متوقع أثناء تحميل الأسئلة.

# UnknownErrorSliderLoad
source: Unexpected error occurred while loading slider questions.
ar: حدث خطأ غير متوقع أثناء تحميل أسئلة شريط التمرير.

# UnknownErrorSmileyLoad
source: Unexpected error occurred while loading smiley questions.
ar: حدث خطأ غير متوقع أثناء تحميل أسئلة الرموز التعبيرية.

# UnknownErrorStarsLoad
source: Unexpected error occurred while loading star questions.
ar: حدث خطأ غير متوقع أثناء تحميل أسئلة النجوم.

# UnknownErrorUpdateLastModified
source: We couldn't update Last Modified due to an unexpected error. Please try again or contact support.
ar: لم نتمكن من تحديث تاريخ آخر تعديل بسبب خطأ غير متوقع. يرجى المحاولة مرة أخرى أو الاتصال بالدعم الفني.

source: Unsupported question type.
ar: نوع السؤال غير مدعوم.

# Validation_EditQuestionDataNull
source: Please provide a question text or caption. This field cannot be empty.
ar: يرجى تقديم نص السؤال أو نص البداية/النهاية. لا يمكن ترك هذا الحقل فارغاً.

# Validation_OrderOutOfRangeAdd
source: Order value must not be grater than number of question + 1 !. Please enter a valid number.
ar: يجب ألا تتجاوز ترتيب السؤال (عدد الأسئلة + 1)! يرجى إدخال رقم صحيح.

# Validation_OrderOutOfRangeEdit
source: Order value must not be grater than number of question + 1 !. Please enter a valid number.
ar: يجب ألا تتجاوز ترتيب السؤال (عدد الأسئلة + 1)! يرجى إدخال رقم صحيح.

# Validation_QuestionDataNull
source: Please provide a question text or caption. This field cannot be empty.
ar: يرجى تقديم نص السؤال أو نص البداية/النهاية. لا يمكن ترك هذا الحقل فارغاً.

# Validation_QuestionTypeInvalid
source: The selected question type is not valid. Please choose a supported type.
ar: نوع السؤال المحدد غير صالح. يرجى اختيار نوع مدعوم.
